trade_exp/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="625474a6-2222-41e9-b50f-6a7e7ff725ac">
    <name>ДатаЗакрытияЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/InformationRegisters/СостоянияЗаказовКлиентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОтразитьСостояниеЗаказа")
Процедура Док_ОтразитьСостояниеЗаказа(Заказы, УдалениеПроведения = Ложь, Ошибки = Неопределено)  
	
	Очередь  = неопределено; 
	
	Если ТипЗнч(Заказы) = Тип("Массив") Тогда
		МассивСсылок = Заказы;
	ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(Заказы) Тогда
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Заказы);
	Иначе
		
		МассивСсылок = Новый Массив();
		Если Заказы.ДополнительныеСвойства.Свойство("МассивЗависимыхЗаказовКлиентов") Тогда
			МассивСсылок = Новый Массив(Заказы.ДополнительныеСвойства.МассивЗависимыхЗаказовКлиентов);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	Если УдалениеПроведения Тогда
		
		Для Каждого СтрокаСсылка Из МассивСсылок Цикл
			Набор = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
			Набор.Отбор.Заказ.Установить(СтрокаСсылка);
			Набор.Записать(Истина);
		КонецЦикла;
		
		Возврат
		
	КонецЕсли;
	
	Для Каждого СтрокаСсылка Из МассивСсылок Цикл	
	    Если СтрокаСсылка.Метаданные().Реквизиты.Найти("КоммерческоеПредложение") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
	
		Если СтрокаСсылка.КоммерческоеПредложение Тогда
			
			НеВсеОтменены = Ложь;
			ТЧТовары = СтрокаСсылка.Товары;
			Для Каждого СтрокаТЧ Из ТЧТовары Цикл
				Если СтрокаТЧ.Отменено = Ложь Тогда
					НеВсеОтменены = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НеВсеОтменены Тогда
				Продолжить;
			КонецЕсли;	
			
			ОтборЗаказ = Новый Структура;
			ОтборЗаказ.Вставить("Заказ", СтрокаСсылка);
		
			Выборка = РегистрыСведений.СостоянияЗаказовКлиентов.Выбрать(ОтборЗаказ);
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Состояние <> Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
				
					Набор = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
					Набор.Отбор.Заказ.Установить(СтрокаСсылка);
					
					СтрокаНабора = Набор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
					СтрокаНабора.Состояние = Перечисления.СостоянияЗаказовКлиентов.Закрыт;
			
					Попытка
						Если Очередь <> Неопределено Тогда
							ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
						Иначе
							Набор.Записать(Истина);
						КонецЕсли;
					Исключение
						Если ТипЗнч(СтрокаСсылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
							ТекстСообщения = НСтр("ru = 'Не удалось отразить состояние заказа клиента: %Ссылка% по причине: %Причина%'");
							ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", СтрокаСсылка);
							ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
							ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
								Метаданные.Документы.ЗаказКлиента, СтрокаСсылка, ТекстСообщения);
						КонецЕсли;
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
